---
kind: property
id: P:Autodesk.Revit.DB.OrdinateDimensionSetting.TextOrientation
source: html/e5ae840a-d518-50e5-366f-280852e34079.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.TextOrientation Property

Specifies where to align the dimension text.

## Syntax (C#)
```csharp
public OrdinateTextOrientation TextOrientation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration